# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "nikitabobko/tap"  # For AeroSpace window manager

# ------------------------------------------------------------------------------
# Essential Tools
# ------------------------------------------------------------------------------
brew "git"
brew "stow"              # Dotfiles management
brew "zsh"               # Latest ZSH
brew "neovim"            # Modern text editor
brew "ripgrep"           # Fast grep (rg) - used in prompt and fzf
brew "fzf"               # Fuzzy finder
brew "bat"               # Better cat with syntax highlighting
brew "lsd"               # Better ls with colors and icons
brew "fd"                # Better find
brew "zoxide"            # Smart cd replacement
brew "tree"              # Directory tree view
brew "jq"                # JSON processor

# ------------------------------------------------------------------------------
# Development Languages & Tools
# ------------------------------------------------------------------------------
brew "node"              # Node.js (direct install, not via nvm)
brew "rustup-init"       # Rust toolchain installer
brew "coreutils"         # GNU core utilities
brew "moreutils"         # Additional utilities
brew "findutils"         # GNU find, xargs, locate
brew "gnu-sed"           # GNU sed
brew "grep"              # GNU grep

# ------------------------------------------------------------------------------
# Cloud & DevOps
# ------------------------------------------------------------------------------
brew "awscli"            # AWS CLI (for aws context detection)
brew "opentofu"          # OpenTofu (Terraform alternative)
brew "docker"            # Docker CLI

# ------------------------------------------------------------------------------
# Security & Authentication
# ------------------------------------------------------------------------------
cask "1password-cli"      # 1Password CLI
brew "openssh"           # OpenSSH client
brew "libfido2"          # FIDO2 library for security keys
brew "ykman"             # YubiKey Manager

# ------------------------------------------------------------------------------
# Media & Download Tools
# ------------------------------------------------------------------------------
brew "yt-dlp"            # Video downloader
brew "gallery-dl"        # Gallery downloader
brew "ffmpeg"            # Media processing
brew "aria2"             # Download manager

# ------------------------------------------------------------------------------
# System & Network Utilities
# ------------------------------------------------------------------------------
brew "htop"              # Better top
brew "ncdu"              # Disk usage analyzer
brew "wget"              # Download utility
brew "tlrc"              # Fast TL;DR client in Rust
brew "mas"               # Mac App Store CLI
brew "terminal-notifier" # Notifications from terminal
brew "wifi-password"     # WiFi password retrieval
# Note: Using native AppleScript trash function instead of external tools
brew "prettyping"        # Better ping
brew "diff-so-fancy"     # Better git diff
brew "fastfetch"         # Fast system info (neofetch replacement)
brew "btop"              # Btop (top replacement)

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------
cask "font-iosevka-term-nerd-font"  # IosevkaTerm NFM for terminal

# ------------------------------------------------------------------------------
# Applications
# ------------------------------------------------------------------------------

# Terminal & Development
cask "ghostty"           # Terminal emulator
cask "visual-studio-code" # Code editor

# System Utilities
cask "gpg-suite"         # GPG tools
cask "pearcleaner"       # App remover
cask "raycast"           # Launcher and productivity

# Media
cask "vlc"               # Media player
cask "obs"               # Streaming/recording

# Browsers
cask "google-chrome"     # Chrome browser
cask "firefox"           # Firefox browser

# Communication & Productivity
cask "slack"             # Team communication
cask "spotify"           # Music streaming

# Security
cask "little-snitch"     # Network monitor
cask "micro-snitch"      # Microphone/camera monitor

# Window Management
cask "aerospace"         # Tiling window manager

# PKM & Notes
cask "obsidian"

# ------------------------------------------------------------------------------
# App Store Applications
# ------------------------------------------------------------------------------
